БухЭксп/InformationRegisters/CW_ПрочитанныеУведомления.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>CW_ПрочитанныеУведомления</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Уведомление</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_УведомленияСайта</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

БухЭксп/InformationRegisters/CW_ПрочитанныеУведомления/Ext/ManagerModule.bsl
Функция УведомлениеПрочитано(Уведомление) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	CW_ПрочитанныеУведомления.Уведомление КАК Уведомление
	               |ИЗ
	               |	РегистрСведений.CW_ПрочитанныеУведомления КАК CW_ПрочитанныеУведомления
	               |ГДЕ
	               |	CW_ПрочитанныеУведомления.Уведомление = &Уведомление
	               |	И CW_ПрочитанныеУведомления.Пользователь = &Пользователь";   
	
	Запрос.УстановитьПараметр("Уведомление", Уведомление);
	Запрос.УстановитьПараметр("Пользователь", ПараметрыСеанса.ТекущийПользователь);
	
	РезультатЗапроса = Запрос.Выполнить();
	
    Возврат НЕ РезультатЗапроса.Пустой();
	
КонецФункции      

Функция ПрочитатьУведомление(Уведомление) Экспорт
	
	Запись = РегистрыСведений.CW_ПрочитанныеУведомления.СоздатьМенеджерЗаписи();
	Запись.Уведомление 	= Уведомление;
	Запись.Пользователь = ПараметрыСеанса.ТекущийПользователь;
	Запись.Записать(истина);
	
КонецФункции    

Функция ОтменитьПрочтениеУведомления(Уведомление) Экспорт
	
	Запись = РегистрыСведений.CW_ПрочитанныеУведомления.СоздатьМенеджерЗаписи();
	Запись.Уведомление 	= Уведомление;
	Запись.Пользователь = ПараметрыСеанса.ТекущийПользователь;
	Запись.Прочитать();
	
	Если Запись.Выбран() Тогда
		Запись.Удалить();
	КонецЕсли;
	
КонецФункции
